read_verilog rtl/evm.v
synth -top votingMachine
write_verilog gl_netlist/evm_gl.v
stat


