# Read RTL
read_verilog rtl/half_adder.v

# Synthesize
synth -top half_adder

# Write gate-level netlist
write_verilog gl_netlist/half_adder_synth.v

# Now capture logs + stat
stat

