read_verilog rtl/jkff.v
synth -top jkff
write_verilog gl_netlist/jkff_gl.v
stat

